var battles = [
    {
        name_ru: 'Советско-германская (<i>Великая Отечественная</i>) война',
        name_uk: 'Німецько-радянська (<i>Велика Вітчизняна</i>) війна',
        beginning: 661,
        end: 2077,
    }, {
        name_ru: 'Польская кампания вермахта',
        name_uk: 'Польська кампанія',
        beginning: 1,
        end: 36,
    }, {
        name_ru: 'советское вторжение в Польшу <i>(«освободительный поход Красной Армии в Западную Украину и Западную Белоруссию»)</i>',
        name_uk: 'вторгнення СРСР до Польщі <i>(«визвольний похід Червоної Армії у Західну Україну й Західну Білорусь»)</i>',
        beginning: 17,
        end: 35,
    }, {
        name_ru: 'Бессарабский (Прутский) поход',
        name_uk: 'Бессарабсько-Буковинський (Прутський) похід',
        beginning: 302,
        end: 307,
    }
]