<?
const LANGS = ['uk', 'ru'];//первый по умолчанию
const MAP_NAME = [
    'uk' => 'мапа України у Другій світовій війні',
    'ru' => 'карта Украины во Второй мировой войне',
];
const LIST_NAME = [
    'uk' => 'міста України у Другій світовій війні',
    'ru' => 'города Украины во Второй мировой войне',
];
const MONTHS = [
    1 => ['uk' => 'січня', 'ru' => 'января'],
    2 => ['uk' => 'лютого', 'ru' => 'февраля'],
    3 => ['uk' => 'березня', 'ru' => 'марта'],
    4 => ['uk' => 'квітня', 'ru' => 'апреля'],
    5 => ['uk' => 'травня', 'ru' => 'мая'],
    6 => ['uk' => 'червня', 'ru' => 'июня'],
    7 => ['uk' => 'липня', 'ru' => 'июля'],
    8 => ['uk' => 'серпня', 'ru' => 'августа'],
    9 => ['uk' => 'вересня', 'ru' => 'сентября'],
    10 => ['uk' => 'жовтня', 'ru' => 'октября'],
    11 => ['uk' => 'листопада', 'ru' => 'ноября'],
    12 => ['uk' => 'грудня', 'ru' => 'декабря']
];
const START_DATE = '1.9.1939';
const END_DATE = '28.10.1944';
const MAP_CENTER = ['latitude' => 48.486, 'longitude' => 31.3];

/**
 * стороны конфликта
 */
const ARMIES = [
    1 => [
        'name_ru' => 'СССР',
        'name_uk' => 'СРСР',
        'flag' => 'URSS',
        'color' => 'ruber',//красный, конечно
    ],
    2 => [
        'name_ru' => 'Германия',
        'name_uk' => 'Німеччина',
        'flag' => 'Germania Nazistica',// sinister',
        'color' => 'brunneus',//коричневый, конечно
    ],
    3 => [
        'name_ru' => 'Румыния',
        'name_uk' => 'Румунія',
        'flag' => 'Romania',
        'color' => 'roseus',//розовый
        'note_ru' => '<span title="города, захваченные Германией и позже переданные в состав Румынии, отмечены как румынские">*</span>',
        'note_uk' => '<span title="міста, захоплені Німеччиною та пізніше передані Румунії, позначені як румунські">*</span>',
    ],
    4 => [
        'name_ru' => 'Венгрия',
        'name_uk' => 'Угорщина',
        'flag' => 'Hungaria',
        'color' => 'caesius',//голубой
    ],
    5 => [
        'name_ru' => 'Польша',
        'name_uk' => 'Польща',
        'flag' => 'Polonia',
        'color' => 'prasinus',//салатневый
    ],
    6 => [
        'name_ru' => 'Украинская повстанческая армия',
        'name_uk' => 'Українська повстанська армія',
        'flag' => 'UPA',
        'color' => 'viridis',//зелёный
        'note_ru' => ' <i>(УПА)</i>',
        'note_uk' => ' <i>(УПА)</i>',
    ],
];

const TEXTS = [
    'battle_begins' => ['uk' => 'починається', 'ru' => 'начинается'],
    'battle_continues' => ['uk' => 'триває', 'ru' => 'продолжается'],
    'battle_ends' => ['uk' => 'закінчується', 'ru' => 'заканчивается'],
    'beginning' => ['uk' => 'початок Другої світової війни',
        'ru' => 'начало Второй Мировой войны'],
    'circles' => ['ru' => 'кружочки', 'uk' => 'кружочки'],
    'description' => [
        'uk' => 'положення сторін у будь-який день війни',
        'ru' => 'положение сторон в любой день войны'
    ],
    'end' => ['uk' => 'визволення території сучасної України від німецьких військ',
        'ru' => 'освобождение территории современной Украины от немецких войск'],
    'flags' => ['ru' => 'флажки', 'uk' => 'прапорці'],
    'lang_country' => ['uk' => 'uk_UA', 'ru' => 'ru_RU'],//для фейсбука
    'languages' => ['uk' => 'українською', 'ru' => 'по-русски'],
    'legend' => ['uk' => 'позначення сторін', 'ru' => 'обозначение сторон'],
    'link' => ['uk' => 'посилання', 'ru' => 'ссылка'],
    'list description' => [
        'uk' => 'список місць, позначених на <a href="../">мапі</a>',
        'ru' => 'список мест, отмеченных на <a href="../">карте</a>'
    ],
    'markers_changer' => ['ru' => 'форма значков', 'uk' => 'форма позначок'],
    'meta' => [
        'uk' => 'дати визволення окупації міст України у Велику Вітчизняну війну,
        дати визволення окупації міст України у Другій світовій війні',
        'ru' => 'даты освобождения оккупации городов Украины во Второй мировой войне,
        даты освобождения оккупации городов Украины в Великую Отечественную войну'
    ],
    'points_list' => ['uk' => 'список міст', 'ru' => 'список городов'],
    'today' => ['uk' => 'у цей день', 'ru' => 'в этот день'],
    'border' => [
        'appearing' => ['uk' => 'утворення', 'ru' => 'установление'],
        'disappearing' => ['uk' => 'скасування', 'ru' => 'снятие'],
    ],
];